try:
    D = int(input("День (D): "))
    M = int(input("Місяць (M): "))
    ZODIAC_DATES = {
        1: (19, "Козеріг", "Водолій"), 2: (18, "Водолій", "Риби"),
        3: (20, "Риби", "Овен"), 4: (19, "Овен", "Телець"),
        5: (20, "Телець", "Близнюки"), 6: (21, "Близнюки", "Рак"),
        7: (22, "Рак", "Лев"), 8: (22, "Лев", "Діва"),
        9: (22, "Діва", "Терези"), 10: (22, "Терези", "Скорпіон"),
        11: (22, "Скорпіон", "Стрілець"), 12: (21, "Стрілець", "Козеріг")
    }
    if 1 <= M <= 12 and 1 <= D <= 31:
        threshold, prev_sign, next_sign = ZODIAC_DATES[M]
        sign = prev_sign if D <= threshold else next_sign
        print(f"Знак Зодіаку: {sign}")
 
except ValueError:
    print("невірний ввід.")